---
kind: property
id: P:Autodesk.Revit.UI.TaskDialog.Id
zh: 提示、弹窗、消息框
source: html/4f0c2d64-6d66-2c88-828a-68dc6b10c4d6.htm
---
# Autodesk.Revit.UI.TaskDialog.Id Property

**中文**: 提示、弹窗、消息框

The Id of the task dialog.

## Syntax (C#)
```csharp
public string Id { get; set; }
```

## Remarks
Id is used as follows:
 TaskDialogShowingEventArgs.DialogId for DialogBoxShowing events As part of the Contextual Help Topic when invoking Revit contextual help